In [1]:
import pandas as pd

## Series from Dict

In [2]:
data = {'first': 0, 'second': 1, 'third': 2}
s = pd.Series(data)
s

first     0
second    1
third     2
dtype: int64

## DF from list of Dicts

In [3]:
data2 = [{'a':1, 'b':2},
         {'a':4, 'b': 7, 'c':12},
         {'a':13,'c':3}]

df = pd.DataFrame(data2)
df

    a    b     c
0   1  2.0   NaN
1   4  7.0  12.0
2  13  NaN   3.0

## Add Index to DF

In [4]:
index = ['first','second','third']
df = pd.DataFrame(data2, index=index)
df

         a    b     c
first    1  2.0   NaN
second   4  7.0  12.0
third   13  NaN   3.0

## Add column to DF

In [5]:
df['d'] = df['a'] + df['c']
df

         a    b     c     d
first    1  2.0   NaN   NaN
second   4  7.0  12.0  16.0
third   13  NaN   3.0  16.0

## Fill NaN Values with 0

In [6]:
df = df.fillna(0)
df['d'] = df['a'] + df['c']
df

         a    b     c     d
first    1  2.0   0.0   1.0
second   4  7.0  12.0  16.0
third   13  0.0   3.0  16.0

## Load data from CSV

In [7]:
df = pd.read_csv("sample1.csv")

# Viewing Data

## Show first 5 rows

In [8]:
df.head()

     DATE         A         B         C         D
0  1/1/19  0.469112 -0.282863 -1.509059 -1.135632
1  1/2/19  1.212112 -0.173215  0.119209 -1.044236
2  1/3/19 -0.861849 -2.104569 -0.494929  1.071804
3  1/4/19  0.721555 -0.706771 -1.039575  0.271860
4  1/5/19 -0.424972  0.567020  0.276232 -1.087401

## Show last 'n' rows

In [9]:
df.tail(3)

     DATE         A         B         C         D
3  1/4/19  0.721555 -0.706771 -1.039575  0.271860
4  1/5/19 -0.424972  0.567020  0.276232 -1.087401
5  1/6/19 -0.673690  0.113648 -1.478427  0.524988

## Describe DF

In [10]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.073711 -0.431125 -0.687758 -0.233103
std    0.843157  0.922818  0.779888  0.973118
min   -0.861849 -2.104569 -1.509059 -1.135632
25%   -0.611510 -0.600794 -1.368714 -1.076610
50%    0.022070 -0.228039 -0.767252 -0.386188
75%    0.658444  0.041932 -0.034326  0.461706
max    1.212112  0.567020  0.276232  1.071804

## List all column names

In [11]:
df.columns

Index(['DATE', 'A', 'B', 'C', 'D'], dtype='object')

## Sort values by column (High to Low)

In [12]:
df.sort_values(by='DATE', ascending=False)

     DATE         A         B         C         D
5  1/6/19 -0.673690  0.113648 -1.478427  0.524988
4  1/5/19 -0.424972  0.567020  0.276232 -1.087401
3  1/4/19  0.721555 -0.706771 -1.039575  0.271860
2  1/3/19 -0.861849 -2.104569 -0.494929  1.071804
1  1/2/19  1.212112 -0.173215  0.119209 -1.044236
0  1/1/19  0.469112 -0.282863 -1.509059 -1.135632

# Selecting Data

## Select column A

In [13]:
df['A']

0    0.469112
1    1.212112
2   -0.861849
3    0.721555
4   -0.424972
5   -0.673690
Name: A, dtype: float64

## Slice by row

In [14]:
df[0:3]

     DATE         A         B         C         D
0  1/1/19  0.469112 -0.282863 -1.509059 -1.135632
1  1/2/19  1.212112 -0.173215  0.119209 -1.044236
2  1/3/19 -0.861849 -2.104569 -0.494929  1.071804

## Selecting based on conditions

In [15]:
df[df.A > 0]

     DATE         A         B         C         D
0  1/1/19  0.469112 -0.282863 -1.509059 -1.135632
1  1/2/19  1.212112 -0.173215  0.119209 -1.044236
3  1/4/19  0.721555 -0.706771 -1.039575  0.271860

## Filtering with .isin()

In [16]:
df['E'] = ['a','a','b','c','e','g']
df[df['E'].isin(['a','e'])]

     DATE         A         B         C         D  E
0  1/1/19  0.469112 -0.282863 -1.509059 -1.135632  a
1  1/2/19  1.212112 -0.173215  0.119209 -1.044236  a
4  1/5/19 -0.424972  0.567020  0.276232 -1.087401  e

## Drop column from DF

In [18]:
df = df.drop(columns=['DATE','E'])
df

          A         B         C         D
0  0.469112 -0.282863 -1.509059 -1.135632
1  1.212112 -0.173215  0.119209 -1.044236
2 -0.861849 -2.104569 -0.494929  1.071804
3  0.721555 -0.706771 -1.039575  0.271860
4 -0.424972  0.567020  0.276232 -1.087401
5 -0.673690  0.113648 -1.478427  0.524988

## Applying functions to DF

In [20]:
df.apply(lambda x: x.max() - x.min())

A    2.073961
B    2.671589
C    1.785291
D    2.207436
dtype: float64

# String Methods

In [21]:
df = pd.read_csv('pokemon.csv')
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

## Convert all str in the 'Name' column  to lowercase

In [30]:
df['Name'] = df['Name'].str.lower()
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,venusaurmega venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

## Group by Type & get count

In [29]:
df.groupby('Type 1')['#'].count()

Type 1
Bug          69
Dark         31
Dragon       32
Electric     44
Fairy        17
Fighting     27
Fire         52
Flying        4
Ghost        32
Grass        70
Ground       32
Ice          24
Normal       98
Poison       28
Psychic      57
Rock         44
Steel        27
Water       112
Name: #, dtype: int64

In [35]:
df.groupby(['Type 1', 'Type 2', 'Name'])['#'].count()

Type 1  Type 2    Name
Bug     Electric  galvantula                 1
                  joltik                     1
        Fighting  heracross                  1
                  heracrossmega heracross    1
        Fire      larvesta                   1
                  volcarona                  1
        Flying    beautifly                  1
                  butterfree                 1
                  combee                     1
                  ledian                     1
                  ledyba                     1
                  masquerain                 1
                  mothim                     1
                  ninjask                    1
                  pinsirmega pinsir          1
                  scyther                    1
                  vespiquen                  1
                  vivillon                   1
                  yanma                      1
                  yanmega                    1
        Ghost     shedinja                   1
        Grass     leavanny                   1
                  paras                      1
                  parasect                   1
                  sewaddle                   1
                  swadloon                   1
                  wormadamplant cloak        1
        Ground    nincada                    1
                  wormadamsandy cloak        1
        Poison    ariados                    1
                                            ..
Water   Ghost     jellicent                  1
        Grass     lombre                     1
                  lotad                      1
                  ludicolo                   1
        Ground    barboach                   1
                  gastrodon                  1
                  marshtomp                  1
                  palpitoad                  1
                  quagsire                   1
                  seismitoad                 1
                  swampert                   1
                  swampertmega swampert      1
                  whiscash                   1
                  wooper                     1
        Ice       cloyster                   1
                  dewgong                    1
                  lapras                     1
        Poison    qwilfish                   1
                  tentacool                  1
                  tentacruel                 1
        Psychic   slowbro                    1
                  slowbromega slowbro        1
                  slowking                   1
                  slowpoke                   1
                  starmie                    1
        Rock      carracosta                 1
                  corsola                    1
                  relicanth                  1
                  tirtouga                   1
        Steel     empoleon                   1
Name: #, Length: 414, dtype: int64

## Select all rows that do not contain the string 'Grass' in the Type 1 column

In [36]:
df[~df['Type 1'].str.contains('Grass')].head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
4,4,charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
5,5,charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
6,6,charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
7,6,charizardmega charizard x,Fire,Dragon,634,78,130,111,130,85,100,1,False
8,6,charizardmega charizard y,Fire,Flying,634,78,104,78,159,115,100,1,False

## Select the row where 'pikachu' is found in the 'Name' column

In [34]:
df[df['Name'] == 'pikachu']

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
30,25,pikachu,Electric,NaN,320,35,55,40,50,50,90,1,False